# Интеграция базового образа
FROM python:3.9.6

# Назначаю рабочий каталог внутри контейнера
# Каталог будет создан если его не было
# В дальнейшем будет использоваться как базовый
WORKDIR /app

# Копирую файл с зависимостями
COPY requirements.txt .

# Устанавливаю менеджер пакетов и зависимости
RUN pip install -U pip
RUN pip install -r requirements.txt

# Копирую остальные файлы проекта
COPY . .

# Этот параметр можно переопределить при СОЗДАНИИ контейнера т.е. run команде
CMD ["pytest", "--browser", "chrome"]